# Sql

In [34]:
# Import libraries
from pysqldf import SQLDF, load_iris
import pandas as pd
import warnings

In [51]:
# Setting
warnings.simplefilter(action='ignore', category=FutureWarning)
sqldf = SQLDF(globals())
iris = load_iris()

In [73]:
# Define excute sql function
def execute_sql(sql):
    return sqldf.execute(sql)

In [84]:
# Simple
sql = """
            SELECT
                *
            FROM
                iris
            LIMIT
                5
      """
execute_sql(sql)

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [85]:
# CASE
sql = """
            SELECT
                sepal_length,
                sepal_width,
                CASE
                  WHEN species = "Iris-setosa" THEN "True"
                  ELSE "False"
                END AS is_setosa
            FROM
                iris
            LIMIT
                5
      """
execute_sql(sql)

   sepal_length  sepal_width is_setosa
0           5.1          3.5      True
1           4.9          3.0      True
2           4.7          3.2      True
3           4.6          3.1      True
4           5.0          3.6      True